[
  {
    "domain": "Economy & Policy",
    "headline": "India's GST Council announces major tax rate overhaul to boost consumption",
    "explain": "The GST Council has implemented a significant tax reform, consolidating most items into two core GST rates (5% and 18%) and introducing a 40% levy on luxury goods. This move, effective September 22, aims to stimulate domestic demand and counter the economic impact of new US tariffs. The changes will make essential goods cheaper while increasing taxes on luxury items, with the government hoping for a rise in consumer spending and GDP growth.",
    "date": "September 5, 2025"
  },
  {
    "domain": "Economy & Policy",
    "headline": "Government launches one-time switch option for pension scheme",
    "explain": "The Finance Ministry has introduced a one-time, unidirectional switch option for central government employees to move from the Unified Pension Scheme (UPS) to the National Pension System (NPS). The deadline for this option is September 30, 2025. This policy provides clarity and a final chance for employees to decide on their preferred retirement scheme, an important development in government employee welfare policies.",
    "date": "September 5, 2025"
  },
  {
    "domain": "Society & Education",
    "headline": "National Teacher Awards 2025 presented by President Droupadi Murmu",
    "explain": "On the occasion of Teacher's Day, President Droupadi Murmu conferred the National Awards for Teachers 2025 to 45 distinguished educators from across the country. The awards recognize the invaluable contribution of teachers in shaping the future of the nation and their innovative practices in the education sector. This is a key annual event for the education sector and a significant date in India's social calendar.",
    "date": "September 5, 2025"
  },
  {
    "domain": "Science & Technology",
    "headline": "Total Lunar Eclipse visible across India",
    "explain": "A total lunar eclipse, also known as a 'Blood Moon,' was visible across India and other parts of Asia, Australia, Africa, and Europe. The totality phase was notably long, lasting for about 82 minutes. The scientific reason for the red color is Rayleigh scattering, which filters out blue light, leaving the red hues to reach the moon's surface. This is a significant astronomical event, and its occurrence can be a subject for questions in government exams, especially related to astronomy and physics.",
    "date": "September 7, 2025"
  },
  {
    "domain": "Economy & Policy",
    "headline": "Central Advisory Council on RERA holds 5th meeting in New Delhi",
    "explain": "The 5th meeting of the Central Advisory Council (CAC) under the Real Estate (Regulation and Development) Act, 2016 (RERA) took place in New Delhi. This event underscores the government's ongoing commitment to regulating the real estate sector and safeguarding the interests of home buyers and other consumers.",
    "date": "September 7, 2025"
  },
  {
    "domain": "Society & Education",
    "headline": "Government releases new guidelines for co-locating Anganwadi Centres with schools",
    "explain": "The Government of India has issued comprehensive guidelines for the co-location of Anganwadi Centres with schools. This initiative is a key part of the national education policy and is designed to strengthen Early Childhood Care and Education (ECCE) across the country.",
    "date": "September 7, 2025"
  },
  {
    "domain": "Health & Demographics",
    "headline": "India's fertility rate declines as per 2023 data",
    "explain": "Recent data from 2023 indicates a continued decline in India's Crude Birth Rate (CBR) and Total Fertility Rate (TFR). This demographic shift points towards a gradually aging population, a significant trend with wide-ranging social and economic implications for the country's future.",
    "date": "September 7, 2025"
  },
  {
    "domain": "Environment & Disaster Management",
    "headline": "Widespread flooding in Punjab and other regions",
    "explain": "Significant flooding has occurred in Punjab and other parts of India, leading to the cancellation of several planned events. This recurring issue highlights the importance of disaster management, climate change mitigation, and government-led relief and rehabilitation efforts.",
    "date": "September 7, 2025"
  },
  {
    "domain": "Economy & Policy",
    "headline": "New rules for unified pension scheme notified under NPS",
    "explain": "The Central government has officially notified new unified pension scheme rules under the National Pension System (NPS). This is a policy change that impacts a large number of government and private sector employees.",
    "date": "September 7, 2025"
  },
  {
    "domain": "Economy & Policy",
    "headline": "₹1,500 crore incentive scheme approved for critical mineral recycling",
    "explain": "The government has given its approval to a ₹1,500 crore incentive scheme aimed at promoting the recycling of critical minerals. This initiative is a significant step towards the country's goal of establishing a circular economy and enhancing resource efficiency.",
    "date": "September 7, 2025"
  },
  {
    "domain": "Agriculture & Rural Development",
    "headline": "Kapas Kisan App launched to empower cotton farmers",
    "explain": "A new application named 'Kapas Kisan App' has been launched with the goal of empowering cotton farmers. The initiative demonstrates the government's focus on leveraging technology to bring about development and efficiency in the agricultural sector.",
    "date": "September 7, 2025"
  },
  {
    "domain": "International Relations",
    "headline": "India and Japan sign pact on critical minerals cooperation",
    "explain": "India and Japan have entered into an agreement for cooperation on critical minerals. This is a strategic move that enhances India's economic security and supply chain resilience in a globally competitive environment.",
    "date": "September 7, 2025"
  },
  {
    "domain": "Defence & Security",
    "headline": "India and US begin joint military exercise 'Yudh Abhyas 2025' in Alaska",
    "explain": "Indian and US armed forces have commenced their joint military exercise, 'Yudh Abhyas 2025,' in Alaska. Such military exercises are a vital component of bilateral relations and cooperation between nations.",
    "date": "September 7, 2025"
  },
  {
    "domain": "Society & Education",
    "headline": "NGO 'Educate Girls' wins Ramon Magsaysay Award 2025",
    "explain": "The Indian NGO 'Educate Girls' has been honored with the prestigious Ramon Magsaysay Award for its dedicated work in promoting girls' education. This recognition highlights the crucial role of non-governmental organizations in social development.",
    "date": "September 7, 2025"
  },
  {
    "domain": "Politics & Governance",
    "headline": "India holds Vice-Presidential election following Jagdeep Dhankhar's resignation",
    "explain": "On September 9, 2025, India's vice-presidential election was held after the unexpected resignation of Vice President Jagdeep Dhankhar in July. This election is a key political event, with the NDA's C. P. Radhakrishnan facing the INDIA bloc's B. Sudershan Reddy. Understanding the electoral process, including the single transferable vote system and the composition of the electoral college (members of both Houses of Parliament), is crucial for competitive exams.",
    "date": "September 9, 2025"
  },
  {
    "domain": "International Relations",
    "headline": "India and Israel sign Bilateral Investment Agreement",
    "explain": "India and Israel formalized a Bilateral Investment Agreement (BIA) to boost economic cooperation and investment between the two nations. This agreement is strategically important as it provides a legal framework for investor protection and dispute resolution, encouraging foreign direct investment and potentially paving the way for a Free Trade Agreement (FTA) in the future.",
    "date": "September 8, 2025"
  },
  {
    "domain": "Sports",
    "headline": "Indian Men's Hockey Team wins Asia Cup title",
    "explain": "The Indian men's hockey team defeated South Korea to win the Asia Cup title after an eight-year gap. This victory is a significant achievement in Indian sports and ensures the team's qualification for the upcoming World Cup. This win highlights the country's growing prowess in the sport.",
    "date": "September 8, 2025"
  },
  {
    "domain": "Economy & Policy",
    "headline": "Government unveils new scheme for domestic construction equipment manufacturing",
    "explain": "In an effort to reduce reliance on imports, the Indian government is developing a new scheme with a proposed outlay of ₹14,000–16,000 crore to promote the domestic manufacturing of construction equipment. This initiative aligns with the 'Make in India' campaign and is aimed at strengthening the country's infrastructure supply chain.",
    "date": "September 9, 2025"
  },
  {
    "domain": "Culture & Heritage",
    "headline": "RBI to issue special coin in tribute to Bhupen Hazarika",
    "explain": "The Reserve Bank of India (RBI) has announced it will issue a special commemorative coin to honor Bharat Ratna Dr. Bhupen Hazarika. This gesture recognizes the immense contribution of the renowned musician, singer, and filmmaker to Indian art and culture, a fact of cultural and historical importance for general knowledge sections of exams.",
    "date": "September 9, 2025"
  },
  {
    "domain": "Economy & Policy",
    "headline": "RBI releases bi-monthly monetary policy update",
    "explain": "The Reserve Bank of India (RBI) announced its bi-monthly monetary policy for September 2025, keeping the repo rate unchanged at 6.50%. The decision aims to maintain inflation within target while supporting economic growth. This is relevant for competitive exams under Indian Economy and Monetary Policy topics.",
    "date": "September 11, 2025"
  },
  {
    "domain": "Science & Technology",
    "headline": "ISRO successfully tests reusable launch vehicle technology",
    "explain": "The Indian Space Research Organisation (ISRO) conducted a successful test of its Reusable Launch Vehicle (RLV) technology. This milestone advances India's capabilities in cost-effective space missions and is important for current affairs in Science & Technology.",
    "date": "September 11, 2025"
  },
  {
    "domain": "International Relations",
    "headline": "India participates in Quad meeting on climate and security",
    "explain": "India attended the Quad summit focused on climate action, regional security, and technology cooperation. The meeting involved leaders from the US, Japan, and Australia. This event is significant for exams covering International Relations and India’s foreign policy.",
    "date": "September 11, 2025"
  },
  {
    "domain": "Society & Education",
    "headline": "New guidelines issued for integrating skill development in schools",
    "explain": "The Ministry of Education released updated guidelines for integrating vocational and skill development programs in school curricula. This initiative aligns with the National Education Policy (NEP) and is relevant for GS Paper 1 and social development topics.",
    "date": "September 11, 2025"
  },
  {
    "domain": "Health & Demographics",
    "headline": "National Health Mission expands immunization coverage",
    "explain": "The National Health Mission announced the expansion of immunization drives to cover remote regions, aiming to improve public health outcomes. This is important for competitive exams under Health & Demographics and Social Sector initiatives.",
    "date": "September 11, 2025"
  },
  {
    "domain": "Environment & Disaster Management",
    "headline": "Monsoon rains trigger landslides in Himachal Pradesh",
    "explain": "Heavy monsoon rains caused landslides in Himachal Pradesh, affecting local communities and transportation. This event highlights disaster management, climate challenges, and government response mechanisms relevant for GS Paper 1 and 3.",
    "date": "September 11, 2025"
  },
  {
    "domain": "Politics & Governance",
    "headline": "Parliament passes bill to strengthen data protection laws",
    "explain": "The Indian Parliament passed amendments to enhance data protection, cybersecurity, and privacy frameworks. Understanding this development is crucial for exams focusing on Governance, Technology Policy, and Legal Frameworks in India.",
    "date": "September 11, 2025"
  },
  {
    "domain": "Politics & Governance",
    "headline": "C.P. Radhakrishnan takes oath as the 15th Vice President of India",
    "explain": "C.P. Radhakrishnan officially assumed office as the 15th Vice President of India in a ceremony at Rashtrapati Bhavan. The oath was administered by President Droupadi Murmu. His election as the NDA nominee was necessitated by the resignation of former Vice President Jagdeep Dhankhar. This event is a key development in Indian politics and is relevant for exams on the Vice President's role and the electoral process.",
    "date": "September 12, 2025"
  },
  {
    "domain": "Defence & Security",
    "headline": "India's first indigenous photonic radar developed by DRDO",
    "explain": "The Defence Research and Development Organisation (DRDO) has successfully developed India's first indigenous photonic radar. This is a significant milestone in India's defence technology, as it enhances the country's self-reliance in advanced radar systems. This development is crucial for competitive exams under the Science and Technology and Defence & Security domains.",
    "date": "September 12, 2025"
  },
  {
    "domain": "Economy & Policy",
    "headline": "India's UPI-UPU project aims to revolutionize global remittances",
    "explain": "India's Unified Payments Interface (UPI) is set to be integrated with the Universal Post Union (UPU) to streamline international remittances. This project will enable quicker, more cost-effective cross-border payments, especially for Indian citizens living abroad. It's a significant development in global financial technology and India's international relations.",
    "date": "September 12, 2025"
  },
  {
    "domain": "Health & Demographics",
    "headline": "AIIMS, New Delhi, launches AI mental health program 'Never Alone'",
    "explain": "The All India Institute of Medical Sciences (AIIMS) in New Delhi has launched a new AI-based mental health program called 'Never Alone.' The initiative is designed to provide mental health support and counseling to those in need, highlighting the increasing use of technology in addressing public health challenges in India. This is a vital topic for exams under the Health and Social Sector.",
    "date": "September 12, 2025"
  },
  {
    "domain": "Economy & Policy",
    "headline": "India hits 250 GW non-fossil fuel power capacity milestone",
    "explain": "India has officially achieved 250 GW of non-fossil fuel electricity generation capacity, a significant step towards its renewable energy targets. This milestone demonstrates the country's commitment to climate action and sustainable development, which is an important subject for exams related to environment, energy, and government policies.",
    "date": "September 12, 2025"
  },
  {
    "domain": "Economy & Policy",
    "headline": "Insurance Surety Bonds for National Highways cross ₹10,000 Cr milestone",
    "explain": "The use of Insurance Surety Bonds (ISBs) for National Highway projects has exceeded ₹10,000 crore. This shift from traditional bank guarantees to ISBs marks a significant change in India's infrastructure financing landscape, improving the liquidity and risk management for contractors. This is a key point for exams under the Economy and Infrastructure section.",
    "date": "September 12, 2025"
  },
  {
    "domain": "Science & Technology",
    "headline": "New Aspergillus species discovered in Western Ghats",
    "explain": "Researchers from the MACS-Agharkar Research Institute in Pune have discovered two new species of black aspergilli fungi in the Western Ghats. These new species, named *Aspergillus dhakephalkarii* and *Aspergillus kuckliae*, are an important finding in the field of mycology and biodiversity, relevant for general science and environment questions.",
    "date": "September 12, 2025"
  },
  {
    "domain": "Society & Education",
    "headline": "IIM Ahmedabad launches first global campus in Dubai",
    "explain": "The Indian Institute of Management Ahmedabad (IIM-A) has inaugurated its first overseas campus in Dubai. This marks a historic step in the internationalization of Indian higher education and demonstrates India's growing influence in the global education sector. This is a key development for exams focused on Education and International Relations.",
    "date": "September 12, 2025"
  },
  {
    "domain": "Law & Governance",
    "headline": "Supreme Court to hear bail pleas of Umar Khalid and others in Delhi riots case",
    "explain": "The Supreme Court of India is scheduled to hear the bail petitions of student activists Umar Khalid, Sharjeel Imam, and others in a case registered under the Unlawful Activities (Prevention) Act (UAPA). This legal proceeding is significant for understanding the country's legal and political landscape, particularly regarding civil liberties and legal frameworks.",
    "date": "September 12, 2025"
  },
  {
    "domain": "Exams & Recruitment",
    "headline": "SSC CGL Tier-1 exam begins for over 28 lakh candidates",
    "explain": "The Staff Selection Commission (SSC) has commenced the Combined Graduate Level Examination (CGLE) Tier-1 exam today. This is a major national-level recruitment exam for government jobs, with over 28 lakh candidates registered. This event is a critical date in the calendar for many job aspirants.",
    "date": "September 12, 2025"
  },
  {
    "domain": "Environment & Ecology",
    "headline": "NGT issues notices over uranium contamination in Punjab’s drinking water",
    "explain": "The National Green Tribunal issued notices to Punjab Pollution Control Board, Health & Family Welfare, Water Supply & Sanitation, and Central Pollution Control Board after finding uranium contamination (>100 ppb in many habitations) in nine districts. Legal action being taken under the Environment Protection Act, 1986 & Water Act, 1974. :contentReference[oaicite:0]{index=0}",
    "date": "September 13, 2025"
  },
  {
    "domain": "Government Schemes & Initiatives",
    "headline": "Haryana launches IWRAP 2025-27 aiming to save 6 lakh crore litres of water by 2027",
    "explain": "Haryana’s Integrated Water Resources Action Plan (IWRAP) 2025-27 targets conserving 6 lakh crore litres of water by 2027, addressing half of its 12 lakh crore litre water deficit; includes methods like rainwater harvesting and block-level data systems. :contentReference[oaicite:1]{index=1}",
    "date": "September 13, 2025"
  },
  {
    "domain": "Polity & Governance",
    "headline": "Indian Railways to flag off first Rajdhani Express service with Mizoram-Delhi link",
    "explain": "A new weekly Rajdhani Express train between Sairang (Mizoram) and Anand Vihar Terminal (Delhi) will be launched on September 13, 2025, beginning regular services from September 19. First Rajdhani in six years serving Mizoram. :contentReference[oaicite:2]{index=2}",
    "date": "September 13, 2025"
  },
  {
    "domain": "Government Schemes & Initiatives",
    "headline": "PM Modi to inaugurate projects worth ₹71,850 crore during five-state tour",
    "explain": "From September 13–15, 2025, Prime Minister Narendra Modi will visit Mizoram, Manipur, Assam, West Bengal, Bihar to inaugurate / lay foundation stones of infrastructure & development projects worth ₹71,850 crore, and flag off three express trains. :contentReference[oaicite:3]{index=3}",
    "date": "September 13, 2025"
  },
  {
    "domain": "Environment & Ecology",
    "headline": "Monsoon withdrawal from Northwest India likely from September 15",
    "explain": "India Meteorological Department (IMD) forecasts southwest monsoon withdrawal beginning around September 15 from northwest India, two days ahead of normal schedule. Important for agriculture, water planning and weather systems. :contentReference[oaicite:4]{index=4}",
    "date": "September 13, 2025"
  },
  {
    "domain": "Science & Technology",
    "headline": "PSCES 2025 conference begins at BHU focusing on quantum & topological materials",
    "explain": "The Physics of Strongly Correlated Electron Systems (PSCES) national conference commenced on September 12 at BHU for researchers to discuss topics like superconductivity, topological materials, spintronics. Over 40 national & international speakers participating. :contentReference[oaicite:5]{index=5}",
    "date": "September 13, 2025"
  },
    {
    "domain": "Economy & Policy",
    "headline": "India's trade deficit narrows to a three-month low",
    "explain": "According to the Ministry of Commerce and Industry, India's trade deficit for August 2025 narrowed to $19.5 billion. This was primarily due to a significant decrease in crude oil imports and an increase in refined petroleum product exports.",
    "date": "September 14, 2025"
  },
  {
    "domain": "Polity & Governance",
    "headline": "Cabinet approves extension of Pradhan Mantri Garib Kalyan Anna Yojana (PMGKAY)",
    "explain": "The Union Cabinet approved the extension of PMGKAY for another six months until March 2026. The scheme provides 5 kg of free food grains per person per month to all beneficiaries under the National Food Security Act (NFSA).",
    "date": "September 14, 2025"
  },
  {
    "domain": "International Relations",
    "headline": "India, France conclude joint naval exercise 'Varuna'",
    "explain": "The 24th edition of the bilateral naval exercise 'Varuna' was concluded in the Arabian Sea. The exercise focused on enhancing interoperability and tactical skills, with both navies deploying advanced frigates and reconnaissance aircraft.",
    "date": "September 14, 2025"
  },
  {
    "domain": "Defence & Security",
    "headline": "DRDO successfully test-fires extended-range Agni-V missile",
    "explain": "The Defence Research and Development Organisation (DRDO) successfully test-fired the Agni-V missile from the Abdul Kalam Island in Odisha. The missile, with a range of over 5,000 km, is a key component of India's nuclear deterrent capability.",
    "date": "September 14, 2025"
  },
  {
    "domain": "Environment & Ecology",
    "headline": "Indian researchers identify new species of tree frog in Western Ghats",
    "explain": "A team of herpetologists from the Indian Institute of Science (IISc), Bengaluru, discovered a new species of tree frog, named 'Rhacophorus gauravi', in the Anamalai Hills of the Western Ghats. The discovery highlights the region's rich biodiversity.",
    "date": "September 14, 2025"
  },
  {
    "domain": "Science & Technology",
    "headline": "ISRO launches Chandrayaan-3 orbiter to conduct lunar reconnaissance",
    "explain": "ISRO's Chandrayaan-3 orbiter was successfully launched aboard the LVM3 rocket from Satish Dhawan Space Centre. The mission aims to conduct detailed reconnaissance of the lunar surface, complementing the data from its previous lander and rover.",
    "date": "September 14, 2025"
  },
  {
    "domain": "Reports, Indices & Rankings",
    "headline": "Global Hunger Index 2025: India improves rank",
    "explain": "The latest Global Hunger Index (GHI) report ranks India 102nd out of 121 countries, showing an improvement from the previous year. The report highlights progress in reducing child stunting and wasting but notes challenges in undernourishment.",
    "date": "September 14, 2025"
  },
  {
    "domain": "Awards & Personalities",
    "headline": "Dr. S. Jaishankar receives Lifetime Achievement Award for Diplomacy",
    "explain": "Union Minister for External Affairs, Dr. S. Jaishankar, was honored with the 'Lifetime Achievement Award for Diplomacy' at a conference in New York. The award recognizes his significant contributions to India's foreign policy and international relations.",
    "date": "September 14, 2025"
  },
  {
    "domain": "Government Schemes & Initiatives",
    "headline": "Ministry of Skill Development launches 'Skill India Mission' portal",
    "explain": "The Ministry of Skill Development and Entrepreneurship launched a new portal as part of the Skill India Mission to connect skilled workers with industries. The portal aims to streamline the job matching process and reduce unemployment.",
    "date": "September 14, 2025"
  },
  {
    "domain": "Government Schemes & Initiatives",
    "headline": "PM Modi launches ₹6,500 crore worth of projects in Assam",
    "explain": "Prime Minister Narendra Modi inaugurated and laid the foundation for projects worth ₹6,500 crore in Darrang, Assam. The initiatives span sectors including infrastructure, healthcare, connectivity, and clean energy.",
    "date": "September 15, 2025"
  },
  {
    "domain": "Awards & Personalities",
    "headline": "Jaismine Lamboria wins gold at World Boxing Championships 2025",
    "explain": "Indian boxer Jaismine Lamboria clinched the gold medal in the women's 57kg category at the World Boxing Championships 2025 in Liverpool, defeating Poland's Szermeta Julia.",
    "date": "September 15, 2025"
  },
  {
    "domain": "Defence & Security",
    "headline": "Tata builds Navy's first Spanish 'Lanza-N' 3D radar",
    "explain": "Tata Advanced Systems has built the first Spanish 'Lanza-N' 3D radar for the Indian Navy. The long-range air defense radar is designed for use in Indian Ocean conditions.",
    "date": "September 15, 2025"
  }
]


